Machine_learning.org
#+TITLE: Machine Learning 
#+OPTIONS: num:nil
#+SETUPFILE: https://fniessen.github.io/org-html-themes/setup/theme-readtheorg.setup
#+STARTUP: content
* Math for ML
** Bayes's Rule

$$ p(x) = \sum_{y} p(X,Y) $$

if x and y are independent:
$$ p(x,y) =  p(y)p(x) = p(x) p(y) = p(y,x) $$ 

条件概论公式 + 全概率公式 = 贝叶斯公式
$$ P(y|x) = \frac{ P(x|y) P(y)}{P(x)}$$
#+begin_src 
+
#+end_src

$$ p(x,y)  =  p(x|y) p(y) $$
$$ p(y,x) = p(y|x)p(x) $$
#+begin_src 
=
#+end_src
$$ P(y|x) = \frac{ P(x,y)}{P(x)}$$

条件概率 = 联合概率/边缘概率

先验概率和后验概率都是条件概率，但是条件已知是先验


** Kovarianz Matrix
seeing link : [[https://scofild429.github.io/subjects/statistik.html][Statistik web]]
org link : [[~/Dropbox/subjects/statistik.org][Startistik org]]

for i = {1...n}, $x_{i}$ is a random variable, which belong to
Gaussian distribution

set 
 $$ X = \left( \begin{aligned}  x_{1} \\ x_{2}\\ . \\. \\x_{n}  \end{aligned}\right) $$


$$ \bar{X} = \left( \begin{aligned}  \bar{x}_{1}
\\ \bar{x}_{2}\\ . \\. \\ \bar{x}_{n}  \end{aligned} \right) $$
co-variance matrix $\Sigma = E [(X-\bar{X})(X-\bar{X})^{T} ]$

\begin{equation}
\Sigma = 
  \left(
  \begin{array}{c}
          x_{1}-\bar{x}_{1} \\
          x_{2}-\bar{x}_{2} \\
          x_{3}-\bar{x}_{3} \\
          ..                \\
          x_{n}-\bar{x}_{n} 
 \end{array}
 \right)
   \left(
  \begin{array}{ccccc}
          x_{1}-\bar{x}_{1} &
          x_{2}-\bar{x}_{2} &
          x_{3}-\bar{x}_{3} &
          ..                &
          x_{n}-\bar{x}_{n} 
  \end{array}
  \right)
\end{equation}
对角线上是对应元素的方差，其他是相对于两个元素的协方差

** Multi variable Gaussian distribution
seeing the link 知乎  [[https://zhuanlan.zhihu.com/p/58987388][zhihu link]]

$$
{\displaystyle f_{\mathbf {X} }(x_{1},\ldots ,x_{k})={\frac {\exp
\left(-{\frac {1}{2}}({\mathbf {x} }-{\boldsymbol {\mu }})^{\mathrm
{T} }{\boldsymbol {\Sigma }}^{-1}({\mathbf {x} }-{\boldsymbol {\mu
}})\right)}{\sqrt {(2\pi )^{k}|{\boldsymbol {\Sigma
}}|}}}}
$$

#+begin_src python

def gaussian(x,mean,cov):
    dim = np.shape(cov)[0] #维度
    #之所以加入单位矩阵是为了防止行列式为0的情况
    covdet = np.linalg.det(cov+np.eye(dim)*0.01) #协方差矩阵的行列式
    covinv = np.linalg.inv(cov+np.eye(dim)*0.01) #协方差矩阵的逆
    xdiff = x - mean
    #概率密度
    prob = 1.0/np.power(2*np.pi,1.0*dim/2)/np.sqrt(np.abs(covdet))*np.exp(-1.0/2*np.dot(np.dot(xdiff,covinv),xdiff))
    return prob

#+end_src

** Mahalanobis distance 

$$ D = \sqrt{ZZ^{T}} $$
马氏距离所使用的变换$$ Z = B^{-1}(X - \mu) $$,
$$ ZZ^{T} = \left(-{\frac {1}{2}}({\mathbf {x} }-{\boldsymbol {\mu }})^{\mathrm
{T} }{\boldsymbol {\Sigma }}^{-1}({\mathbf {x} }-{\boldsymbol {\mu
}})\right)
$$
$$ \Sigma = \sum U \Lambda U^{T} $$
$$ \Sigma^{-1} = \sum U \Lambda^{-1} U^{T} $$
关于新的坐标，U 是变换的旋转，$\Lambda$ 是基底的延伸，$(x-\mu)$ 是在其
上的投影，此后，在新坐标上，即为多变量，标准，不相关高斯分布

** precision 查准率 recall 查全率

|-----+---------------+-------------------------------------------------+-------------------------------------------------|
| TPR | recall 查全 R | predict positive 测正 &  实正 actually positive | predict negative 测反 & 实正  actually positive |
| FPR |               | predict positive 测正 &  实反 actually negative | predict negative  测反 & 实反 actually negative |
|-----+---------------+-------------------------------------------------+-------------------------------------------------|
|     |               | precision 查准 P                                |                                                 |

R-P Couve : R P
ROC couve : FPR TPR

$$ F_{1} = \frac{1}{2} \cdot (\frac{1}{P}+\frac{1}{R})$$
$$ F_{\beta} = \frac{1}{\beta^{2}} \cdot
(\frac{\beta^{2}}{P}+\frac{1}{R})$$

关联性属性 ： 高中低 （3,2,1）
非关联性属性： 猪狗羊 （(1,0,0), (0,1,0),(0,0,1)）




* Algorithms
