Machine_learning.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2020-07-17 Fr 00:31 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Machine Learning</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="sx" />
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/styles/readtheorg/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/styles/readtheorg/css/readtheorg.css"/>
</head>
<body>
<div id="content">
<h1 class="title">Machine Learning</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org4dd512b">Math for ML</a>
<ul>
<li><a href="#org72c7fea">Bayes's Rule</a></li>
<li><a href="#orgec438e6">Kovarianz Matrix</a></li>
<li><a href="#orgc4aa8b3">Multi variable Gaussian distribution</a></li>
<li><a href="#orgfd4ff24">Mahalanobis distance</a></li>
<li><a href="#orgf84748a">precision 查准率 recall 查全率</a></li>
</ul>
</li>
<li><a href="#orgccfb525">Algorithms</a>
<ul>
<li><a href="#org63b707e">OLS 正规化方程</a></li>
<li><a href="#orgc03ee6f">朴素贝叶斯</a></li>
<li><a href="#org3bef8ce">Decision List</a></li>
<li><a href="#orgdff9466">Decision tree</a>
<ul>
<li><a href="#orgdaa48db">方法描述和变量</a></li>
<li><a href="#org6805291">预剪枝和后剪枝</a></li>
<li><a href="#org3c493e0">属性有连续值和缺失值</a></li>
<li><a href="#orgcc44d9e">多变量决策</a></li>
</ul>
</li>
<li><a href="#orgc1c08d8">Random Forest</a></li>
<li><a href="#org2ad3f4d">gradient decent</a></li>
<li><a href="#orgfab9572">linear regression</a></li>
<li><a href="#org094b40f">Support Vector Machine</a></li>
<li><a href="#org7be53a6">logical regression</a></li>
<li><a href="#orgfba16a8">Neural network</a></li>
<li><a href="#org9244559">Conversational neural Network</a></li>
<li><a href="#org01864d4">linear Discriminate Analysis(Fisher)</a>
<ul>
<li><a href="#org166a11f">算法简介</a></li>
</ul>
</li>
<li><a href="#orge37e9d4">Principe Component Analysis</a></li>
<li><a href="#org9f2fa41">K-Means</a>
<ul>
<li><a href="#orgc6d33d9">算法介绍</a></li>
<li><a href="#org91b2b71">code</a></li>
</ul>
</li>
<li><a href="#org9cb622f">EM algorithms</a></li>
<li><a href="#org353caeb">link</a></li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-org4dd512b" class="outline-2">
<h2 id="org4dd512b">Math for ML</h2>
<div class="outline-text-2" id="text-org4dd512b">
</div>
<div id="outline-container-org72c7fea" class="outline-3">
<h3 id="org72c7fea">Bayes's Rule</h3>
<div class="outline-text-3" id="text-org72c7fea">
<p>
\[ p(x) = \sum_{y} p(X,Y) \]
</p>

<p>
if x and y are independent:
\[ p(x,y) =  p(y)p(x) = p(x) p(y) = p(y,x) \] 
</p>

<p>
条件概论公式 + 全概率公式 = 贝叶斯公式
\[ P(y|x) = \frac{ P(x|y) P(y)}{P(x)}\]
</p>
<pre class="example">
+
</pre>

<p>
\[ p(x,y)  =  p(x|y) p(y) \]
\[ p(y,x) = p(y|x)p(x) \]
</p>
<pre class="example">
=
</pre>
<p>
\[ P(y|x) = \frac{ P(x,y)}{P(x)}\]
</p>

<p>
条件概率 = 联合概率/边缘概率
</p>

<p>
先验概率和后验概率都是条件概率，但是条件已知是先验
</p>
</div>
</div>


<div id="outline-container-orgec438e6" class="outline-3">
<h3 id="orgec438e6">Kovarianz Matrix</h3>
<div class="outline-text-3" id="text-orgec438e6">
<p>
seeing link : <a href="https://scofild429.github.io/subjects/statistik.html">Statistik web</a>
org link : <a href="file:///home/sx/Dropbox/subjects/statistik.html">Startistik org</a>
</p>

<p>
for i = {1&#x2026;n}, \(x_{i}\) is a random variable, which belong to
Gaussian distribution
</p>

<p>
set 
 \[ X = \left( \begin{aligned}  x_{1} \\ x_{2}\\ . \\. \\x_{n}  \end{aligned}\right) \]
</p>


<p>
\[ \bar{X} = \left( \begin{aligned}  \bar{x}_{1}
\\ \bar{x}_{2}\\ . \\. \\ \bar{x}_{n}  \end{aligned} \right) \]
co-variance matrix \(\Sigma = E [(X-\bar{X})(X-\bar{X})^{T} ]\)
</p>

\begin{equation}
\Sigma = 
  \left(
  \begin{array}{c}
          x_{1}-\bar{x}_{1} \\
          x_{2}-\bar{x}_{2} \\
          x_{3}-\bar{x}_{3} \\
          ..                \\
          x_{n}-\bar{x}_{n} 
 \end{array}
 \right)
   \left(
  \begin{array}{ccccc}
          x_{1}-\bar{x}_{1} &
          x_{2}-\bar{x}_{2} &
          x_{3}-\bar{x}_{3} &
          ..                &
          x_{n}-\bar{x}_{n} 
  \end{array}
  \right)
\end{equation}
<p>
对角线上是对应元素的方差，其他是相对于两个元素的协方差
</p>
</div>
</div>

<div id="outline-container-orgc4aa8b3" class="outline-3">
<h3 id="orgc4aa8b3">Multi variable Gaussian distribution</h3>
<div class="outline-text-3" id="text-orgc4aa8b3">
<p>
seeing the link 知乎  <a href="https://zhuanlan.zhihu.com/p/58987388">zhihu link</a>
</p>

<p>
\[
{\displaystyle f_{\mathbf {X} }(x_{1},\ldots ,x_{k})={\frac {\exp
\left(-{\frac {1}{2}}({\mathbf {x} }-{\boldsymbol {\mu }})^{\mathrm
{T} }{\boldsymbol {\Sigma }}^{-1}({\mathbf {x} }-{\boldsymbol {\mu
}})\right)}{\sqrt {(2\pi )^{k}|{\boldsymbol {\Sigma
}}|}}}}
\]
</p>

<div class="org-src-container">
<pre class="src src-python">
<span style="color: #4f97d7; font-weight: bold;">def</span> <span style="color: #bc6ec5; font-weight: bold;">gaussian</span>(x,mean,cov):
    <span style="color: #7590db;">dim</span> = np.shape(cov)[0] <span style="color: #2aa1ae; background-color: #292e34;">#</span><span style="color: #2aa1ae; background-color: #292e34;">&#32500;&#24230;</span>
    <span style="color: #2aa1ae; background-color: #292e34;">#</span><span style="color: #2aa1ae; background-color: #292e34;">&#20043;&#25152;&#20197;&#21152;&#20837;&#21333;&#20301;&#30697;&#38453;&#26159;&#20026;&#20102;&#38450;&#27490;&#34892;&#21015;&#24335;&#20026;0&#30340;&#24773;&#20917;</span>
    <span style="color: #7590db;">covdet</span> = np.linalg.det(cov+np.eye(dim)*0.01) <span style="color: #2aa1ae; background-color: #292e34;">#</span><span style="color: #2aa1ae; background-color: #292e34;">&#21327;&#26041;&#24046;&#30697;&#38453;&#30340;&#34892;&#21015;&#24335;</span>
    <span style="color: #7590db;">covinv</span> = np.linalg.inv(cov+np.eye(dim)*0.01) <span style="color: #2aa1ae; background-color: #292e34;">#</span><span style="color: #2aa1ae; background-color: #292e34;">&#21327;&#26041;&#24046;&#30697;&#38453;&#30340;&#36870;</span>
    <span style="color: #7590db;">xdiff</span> = x - mean
    <span style="color: #2aa1ae; background-color: #292e34;">#</span><span style="color: #2aa1ae; background-color: #292e34;">&#27010;&#29575;&#23494;&#24230;</span>
    <span style="color: #7590db;">prob</span> = 1.0/np.power(2*np.pi,1.0*dim/2)/np.sqrt(np.<span style="color: #4f97d7;">abs</span>(covdet))*np.exp(-1.0/2*np.dot(np.dot(xdiff,covinv),xdiff))
    <span style="color: #4f97d7; font-weight: bold;">return</span> prob

</pre>
</div>
</div>
</div>

<div id="outline-container-orgfd4ff24" class="outline-3">
<h3 id="orgfd4ff24">Mahalanobis distance</h3>
<div class="outline-text-3" id="text-orgfd4ff24">
<p>
\[ D = \sqrt{ZZ^{T}} \]
马氏距离所使用的变换\[ Z = B^{-1}(X - \mu) \],
\[ ZZ^{T} = \left(-{\frac {1}{2}}({\mathbf {x} }-{\boldsymbol {\mu }})^{\mathrm
{T} }{\boldsymbol {\Sigma }}^{-1}({\mathbf {x} }-{\boldsymbol {\mu
}})\right)
\]
\[ \Sigma = \sum U \Lambda U^{T} \]
\[ \Sigma^{-1} = \sum U \Lambda^{-1} U^{T} \]
关于新的坐标，U 是变换的旋转，\(\Lambda\) 是基底的延伸，\((x-\mu)\) 是在其
上的投影，此后，在新坐标上，即为多变量，标准，不相关高斯分布
</p>
</div>
</div>

<div id="outline-container-orgf84748a" class="outline-3">
<h3 id="orgf84748a">precision 查准率 recall 查全率</h3>
<div class="outline-text-3" id="text-orgf84748a">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">TPR</th>
<th scope="col" class="org-left">recall 查全 R</th>
<th scope="col" class="org-left">predict positive 测正 &amp;  实正 actually positive</th>
<th scope="col" class="org-left">predict negative 测反 &amp; 实正  actually positive</th>
</tr>

<tr>
<th scope="col" class="org-left">FPR</th>
<th scope="col" class="org-left">&#xa0;</th>
<th scope="col" class="org-left">predict positive 测正 &amp;  实反 actually negative</th>
<th scope="col" class="org-left">predict negative  测反 &amp; 实反 actually negative</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">precision 查准 P</td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
</table>

<p>
R-P Couve : R P
ROC couve : FPR TPR
</p>

<p>
\[ F_{1} = \frac{1}{2} \cdot (\frac{1}{P}+\frac{1}{R})\]
\[ F_{\beta} = \frac{1}{\beta^{2}} \cdot
(\frac{\beta^{2}}{P}+\frac{1}{R})\]
</p>

<p>
关联性属性 ： 高中低 （3,2,1）
非关联性属性： 猪狗羊 （(1,0,0), (0,1,0),(0,0,1)）
</p>
</div>
</div>
</div>
