Machine_learning.html




<div id="outline-container-orgccfb525" class="outline-2">
<h2 id="orgccfb525">Algorithms</h2>
<div class="outline-text-2" id="text-orgccfb525">
</div>
<div id="outline-container-org63b707e" class="outline-3">
<h3 id="org63b707e">OLS 正规化方程</h3>
<div class="outline-text-3" id="text-org63b707e">
<pre class="example">
正则化方程的推导，用高斯分布的多变量分布的Maxisum likelihood,能一起求
得对weight和bias值 : 
但是要添加一列1到 train 和 test，至于在前面还是后面有点怪异。
目前认为，在后面的话，多变量和参数可以按需求访问
</pre>

<p>
\[\theta = (X^{T}X)^{-1}X^{T}y \]
</p>


<div class="org-src-container">
<pre class="src src-python"><span style="color: #4f97d7; font-weight: bold;">import</span> numpy <span style="color: #4f97d7; font-weight: bold;">as</span> np
<span style="color: #4f97d7; font-weight: bold;">import</span> random
<span style="color: #4f97d7; font-weight: bold;">from</span> sklearn <span style="color: #4f97d7; font-weight: bold;">import</span> linear_model
<span style="color: #7590db;">testsize</span> = 5

<span style="color: #7590db;">x</span> = np.array([a <span style="color: #4f97d7; font-weight: bold;">for</span> a <span style="color: #4f97d7; font-weight: bold;">in</span> <span style="color: #4f97d7;">range</span>(100)])
<span style="color: #7590db;">onesx</span> = np.ones(x.shape)
<span style="color: #7590db;">X</span> = np.c_[x,onesx]
<span style="color: #7590db;">y</span> = np.array([a*5 + 20 + random.randint(0,3) <span style="color: #4f97d7; font-weight: bold;">for</span> a <span style="color: #4f97d7; font-weight: bold;">in</span> <span style="color: #4f97d7;">range</span>(100)])
<span style="color: #4f97d7; font-weight: bold;">print</span>(<span style="color: #2d9574;">"the X shape is {}, and y shape is {}"</span>.<span style="color: #4f97d7;">format</span>(X.shape, y.shape))

<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">weight = np.dot(np.dot(np.linalg.pinv(np.dot(X.T, X)), X.T), y)</span>
<span style="color: #7590db;">weight</span> = np.linalg.inv(X.T.dot(X)).dot(X.T).dot(y)

<span style="color: #4f97d7; font-weight: bold;">print</span>(<span style="color: #2d9574;">"OLS : the weight is{}, and the bais is {} "</span>.<span style="color: #4f97d7;">format</span>(weight[:-1], weight[-1]))
<span style="color: #4f97d7; font-weight: bold;">print</span>(<span style="color: #2d9574;">"the predect of 5 ele is {}"</span>.<span style="color: #4f97d7;">format</span>(np.dot(np.c_[np.arange(testsize),np.ones(testsize)], weight)))


</pre>
</div>

<pre class="example">
也可以是对变量 with multi variables
</pre>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #4f97d7; font-weight: bold;">import</span> numpy <span style="color: #4f97d7; font-weight: bold;">as</span> np
<span style="color: #4f97d7; font-weight: bold;">import</span> random
<span style="color: #4f97d7; font-weight: bold;">from</span> sklearn <span style="color: #4f97d7; font-weight: bold;">import</span> linear_model
<span style="color: #7590db;">testsize</span> = 5

<span style="color: #7590db;">x</span> = np.array([a <span style="color: #4f97d7; font-weight: bold;">for</span> a <span style="color: #4f97d7; font-weight: bold;">in</span> <span style="color: #4f97d7;">range</span>(100)])
<span style="color: #7590db;">onesx</span> = np.ones(x.shape)
<span style="color: #7590db;">X</span> = np.c_[onesx, x, 2*x]
<span style="color: #7590db;">y</span> = np.array([a*5 + 20 + random.randint(0,3) <span style="color: #4f97d7; font-weight: bold;">for</span> a <span style="color: #4f97d7; font-weight: bold;">in</span> <span style="color: #4f97d7;">range</span>(100)])
<span style="color: #4f97d7; font-weight: bold;">print</span>(<span style="color: #2d9574;">"the X shape is {}, and y shape is {}"</span>.<span style="color: #4f97d7;">format</span>(X.shape, y.shape))

<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">ordinary  least squares (&#27491;&#35268;&#21270;&#26041;&#27861;&#65289;</span>
<span style="color: #7590db;">weight</span> = np.dot(np.dot(np.linalg.pinv(np.dot(X.T, X)), X.T), y)
<span style="color: #4f97d7; font-weight: bold;">print</span>(<span style="color: #2d9574;">"OLS : the weight is{}, and the bais is {} "</span>.<span style="color: #4f97d7;">format</span>(weight[:-1], weight[-1]))
<span style="color: #4f97d7; font-weight: bold;">print</span>(<span style="color: #2d9574;">"the predect of 5 ele is {}"</span>.<span style="color: #4f97d7;">format</span>(np.dot(np.c_[np.arange(testsize), np.arange(testsize),np.ones(testsize)], weight)))


</pre>
</div>
</div>
</div>


<div id="outline-container-orgc03ee6f" class="outline-3">
<h3 id="orgc03ee6f">朴素贝叶斯</h3>
<div class="outline-text-3" id="text-orgc03ee6f">
<p>
假设各个属性完全独立
要判断某示例的分类，分别计算出该示例在每个分类中的概论乘以该类别中该示
例的各种属性出现的条件概论， 谁大选谁。（注意样本不足引起的某属性的条
件为零）
</p>
</div>
</div>



<div id="outline-container-org3bef8ce" class="outline-3">
<h3 id="org3bef8ce">Decision List</h3>
<div class="outline-text-3" id="text-org3bef8ce">
<p>
(f1,v1),(f2,v2)&#x2026;.(fr,vr)
fi is a term in CNF, vi belongs {0,1}, and the last term fr is always
true. and each term can be viewed as if else extended. if fi is
matched, so vi is its value.
</p>

<pre class="example">
for 0&lt;k&lt;n, k-CNF and k-DNF are proper 


</pre>
</div>
</div>


<div id="outline-container-orgdff9466" class="outline-3">
<h3 id="orgdff9466">Decision tree</h3>
<div class="outline-text-3" id="text-orgdff9466">
</div>
<div id="outline-container-orgdaa48db" class="outline-4">
<h4 id="orgdaa48db">方法描述和变量</h4>
<div class="outline-text-4" id="text-orgdaa48db">
<p>
在训练集内以最大信息增益来确定划分属性，在各个子区内再重复剩下的属性
</p>

<p>
信息熵
\[ Ent(D)=-\sum^{y}_{k=1}p_{k}log_{2}^{p_{k}}\]
</p>

<p>
信息熵增益
\[ Gain(D,a) = Ent(D)-\sum^{V}_{v=1}\frac{|D^{v}|}{|D|}Ent(D^{v}) \]
</p>

<p>
吉尼系数
\[ Gini(D) = \sum^{|y|}_{k=1}\sum_{k^{'}\not = k} p_{k}p_{k^{'}} = 1- \sum^{|y|}_{k=1}p_{k}^{2}\]
</p>
</div>
</div>

<div id="outline-container-org6805291" class="outline-4">
<h4 id="org6805291">预剪枝和后剪枝</h4>
<div class="outline-text-4" id="text-org6805291">
<p>
在利用训练集的最大信息增益确定划分属性后，用验证集来检验划分，如果验证
集的信息熵增加，（泛化结果不好)否定此次划分，设为叶节点
</p>

<p>
后剪枝是在这个树完成后，用验证集去检验每一个内节点，从下到上，如果去掉
该划分有更小的信息熵，则废除该划分。
</p>
</div>
</div>

<div id="outline-container-org3c493e0" class="outline-4">
<h4 id="org3c493e0">属性有连续值和缺失值</h4>
<div class="outline-text-4" id="text-org3c493e0">
<p>
连续值离散化：排列该属性的所有取值n个，在n-1个区间中去中间值为离散值，
遍历所有离散值，找到最大信息增益的离散值，作二分。
</p>

<p>
缺失值，取出该属性的非缺失子集，再配以相应的比率计算信息增益，处理和以
前一样。如果选出的划分属性有缺失值，则给划分不作用到缺失样本，复制到每
个划分子集
</p>
</div>
</div>
<div id="outline-container-orgcc44d9e" class="outline-4">
<h4 id="orgcc44d9e">多变量决策</h4>
<div class="outline-text-4" id="text-orgcc44d9e">
<p>
每个划分属性是多个属性（变量）的线性组合
</p>
</div>
</div>
</div>
