Machine_learning.html


<div id="outline-container-orgc1c08d8" class="outline-3">
<h3 id="orgc1c08d8">Random Forest</h3>
</div>

<div id="outline-container-org2ad3f4d" class="outline-3">
<h3 id="org2ad3f4d">gradient decent</h3>
<div class="outline-text-3" id="text-org2ad3f4d">
<p>
当数据点很多是，正则化方法计算量将非常大，此时较多使用梯度下降
</p>

<pre class="example">
sklearn API
</pre>

<div class="org-src-container">
<pre class="src src-python">
<span style="color: #4f97d7; font-weight: bold;">import</span> numpy <span style="color: #4f97d7; font-weight: bold;">as</span> np
<span style="color: #4f97d7; font-weight: bold;">import</span> random
<span style="color: #4f97d7; font-weight: bold;">from</span> sklearn <span style="color: #4f97d7; font-weight: bold;">import</span> linear_model
<span style="color: #7590db;">testsize</span> = 5

<span style="color: #7590db;">x</span> = np.array([a <span style="color: #4f97d7; font-weight: bold;">for</span> a <span style="color: #4f97d7; font-weight: bold;">in</span> <span style="color: #4f97d7;">range</span>(100)])
<span style="color: #7590db;">onesx</span> = np.ones(x.shape)
<span style="color: #7590db;">X</span> = np.c_[x, 2*x, onesx]
<span style="color: #7590db;">y</span> = np.array([a*5 + 20 + random.randint(0,3) <span style="color: #4f97d7; font-weight: bold;">for</span> a <span style="color: #4f97d7; font-weight: bold;">in</span> <span style="color: #4f97d7;">range</span>(100)])
<span style="color: #4f97d7; font-weight: bold;">print</span>(<span style="color: #2d9574;">"the X shape is {}, and y shape is {}"</span>.<span style="color: #4f97d7;">format</span>(X.shape, y.shape))

<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">Sklearn API</span>
<span style="color: #7590db;">reg</span> = linear_model.LinearRegression()
<span style="color: #7590db;">model</span> = reg.fit(X,y)
<span style="color: #4f97d7; font-weight: bold;">print</span>(<span style="color: #2d9574;">"Sklearn: the weith is {}, and the intercept is {}"</span>.<span style="color: #4f97d7;">format</span>(model.coef_[:-1] ,model.intercept_))
<span style="color: #4f97d7; font-weight: bold;">print</span>(<span style="color: #2d9574;">"the predect of 3 ele is {}"</span>.<span style="color: #4f97d7;">format</span>(model.predict(np.c_[np.arange(testsize), np.arange(testsize),np.ones(testsize)])))


<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">manual </span>
<span style="color: #4f97d7; font-weight: bold;">def</span> <span style="color: #bc6ec5; font-weight: bold;">featureNormalize</span>(X):
    (m,n) = X.shape
    <span style="color: #7590db;">X_norm</span> = X
    <span style="color: #7590db;">mu</span> = np.zeros(n);
    <span style="color: #7590db;">sigma</span> = np.zeros(n);
    <span style="color: #4f97d7; font-weight: bold;">for</span> i <span style="color: #4f97d7; font-weight: bold;">in</span> <span style="color: #4f97d7;">range</span>(n):
        <span style="color: #7590db;">mu</span>[i] = np.mean(X[:,i])
        <span style="color: #7590db;">sigma</span>[i] = np.std(X[:,i])
        <span style="color: #7590db;">X_norm</span>[:,i] = (X_norm[:,i]-mu[i])/sigma[i]
    <span style="color: #4f97d7; font-weight: bold;">return</span> X_norm
<span style="color: #4f97d7; font-weight: bold;">def</span> <span style="color: #bc6ec5; font-weight: bold;">computeCost</span>(X, y, theta):
    <span style="color: #4f97d7; font-weight: bold;">return</span> np.<span style="color: #4f97d7;">sum</span>((np.dot(X,theta) -y)**2)/(2*<span style="color: #4f97d7;">len</span>(y));

<span style="color: #4f97d7; font-weight: bold;">def</span> <span style="color: #bc6ec5; font-weight: bold;">gradientDescent</span>(X, y, theta, alpha, num_iters):
    <span style="color: #7590db;">m</span> = <span style="color: #4f97d7;">len</span>(y)
    <span style="color: #7590db;">J_history</span> = np.zeros(num_iters);
    <span style="color: #7590db;">theta_len</span> = <span style="color: #4f97d7;">len</span>(theta);
    <span style="color: #4f97d7; font-weight: bold;">for</span> num_iter <span style="color: #4f97d7; font-weight: bold;">in</span> <span style="color: #4f97d7;">range</span>(num_iters):
        <span style="color: #7590db;">theta</span> = theta - (alpha/m)*np.dot(X.T,(np.dot(X,theta).reshape(-1)-y))
        <span style="color: #7590db;">J_history</span>[num_iter] = computeCost(X, y, theta)
    <span style="color: #4f97d7; font-weight: bold;">return</span> theta, J_history

<span style="color: #7590db;">alpha</span> = 0.0001
<span style="color: #7590db;">num_iters</span> = 400000
<span style="color: #7590db;">theta</span> = np.zeros(2+1)
<span style="color: #7590db;">theta</span>, <span style="color: #7590db;">J_history</span> = gradientDescent(X, y, theta, alpha, num_iters)
<span style="color: #4f97d7; font-weight: bold;">print</span>(<span style="color: #2d9574;">"Greadient decent: the weight is {}, and the intercept is {}"</span>.<span style="color: #4f97d7;">format</span>(theta[:-1],theta[-1]))
<span style="color: #4f97d7; font-weight: bold;">print</span>(<span style="color: #2d9574;">"the predect of 3 ele is {}"</span>.<span style="color: #4f97d7;">format</span>(np.dot(np.c_[np.arange(testsize), np.arange(testsize),np.ones(testsize)], theta)))
</pre>
</div>
</div>
</div>



<div id="outline-container-orgfab9572" class="outline-3">
<h3 id="orgfab9572">linear regression</h3>
</div>

<div id="outline-container-org094b40f" class="outline-3">
<h3 id="org094b40f">Support Vector Machine</h3>
</div>

<div id="outline-container-org7be53a6" class="outline-3">
<h3 id="org7be53a6">logical regression</h3>
</div>

<div id="outline-container-orgfba16a8" class="outline-3">
<h3 id="orgfba16a8">Neural network</h3>
</div>

<div id="outline-container-org9244559" class="outline-3">
<h3 id="org9244559">Conversational neural Network</h3>
</div>

<div id="outline-container-org01864d4" class="outline-3">
<h3 id="org01864d4">linear Discriminate Analysis(Fisher)</h3>
<div class="outline-text-3" id="text-org01864d4">
</div>
<div id="outline-container-org166a11f" class="outline-4">
<h4 id="org166a11f">算法简介</h4>
<div class="outline-text-4" id="text-org166a11f">
<p>
输入为j=0，1类样本，每类分别 \(N_{j}\) 个样本
\(\mu_j = \frac{1}{N_{j}} \sum x\) \(x \in N_{j}\)
\(\Sigma_{j} = \sum(x-\mu_{j})(x-\mu_{j})^{T}\), \(x \in N_{j}\)
</p>

<p>
\(argmax(J) = \frac{\omega^{T} (\mu_0-\mu_1)(\mu_0-\mu_1)^T
\omega}{\omega^T(\Sigma_0+\Sigma_1)\omega } =  \frac{\omega^{T} S_{b}
\omega}{\omega^T S_{w} \omega }\)
</p>
</div>
</div>
</div>





<div id="outline-container-orge37e9d4" class="outline-3">
<h3 id="orge37e9d4">Principe Component Analysis</h3>
</div>

<div id="outline-container-org9f2fa41" class="outline-3">
<h3 id="org9f2fa41">K-Means</h3>
<div class="outline-text-3" id="text-org9f2fa41">
</div>
<div id="outline-container-orgc6d33d9" class="outline-4">
<h4 id="orgc6d33d9">算法介绍</h4>
<div class="outline-text-4" id="text-orgc6d33d9">
<p>
输入样本集 D: \(x_{1}, x_{1}, x_{2},,,x_{m}\)
聚类数 k, 
最大迭代数 N,
期望输出: \(C_{1}, C_{2},,,C_{k}\)
</p>

<p>
随机初始化k个聚类中心，并作不同类别的标记
for i= 1,2,..N:
    初始化所有C
    计算每个点到每个中心的距离，并被最小距离的聚类中心标记
    对于所有相同标记的聚类更新中心，再重复上一步骤，直到没有变化为止
</p>
</div>
</div>
