Machine_learning.org
*** code

#+begin_src python :results output
  import random
  import numpy as np
  import matplotlib.pyplot as plt

  b = []
  for i in range(100):
      a = np.array(list([(20,50),(30,10),(60,30)]))
      for j in range(a.shape[0]):
          for k in range(a.shape[1]):
              a[j][k] += random.randint(0,30)
              b.append(a[j])

  b = np.array(b)
  plt.plot(b[:,0], b[:,1], 'ro')
  plt.title("toy data")
  plt.show()


  # sklearn API
  from sklearn.cluster import KMeans
  y_pred = KMeans(n_clusters=3, random_state=9).fit_predict(b)
  plt.scatter(b[:, 0], b[:, 1], c=y_pred)
  plt.title("toy data with sklearn API")
  plt.show()

  # manual
  def findClosestCentroids(X, centroids):
      distance = np.zeros((len(X),len(centroids)))
      for i in range(len(X)):
          for j in range(len(centroids)):
              distance[i,j] = np.linalg.norm(X[i,:]-centroids[j,:])
      return np.argmin(distance,axis=1)

  def computeCentroids(X, idx, K):
      centroids = np.zeros((K,X.shape[1]))
      for i in range(K):
          centroids[i,:] = np.mean(X[idx == i],axis = 0)
      return centroids


  def runkMeans(X,K,max_iters):
      indexs = np.random.choice(np.array(range(len(X))), K,replace=False)
      centroids = X[indexs]
      for max_iter in range(max_iters):
          idx = findClosestCentroids(X, centroids)
          centroids = computeCentroids(X, idx, K)
          colors = ['','','']
          for i in range(K):
              plt.scatter(X[idx==i, 0], X[idx==i, 1])
          plt.scatter(centroids[:, 0], centroids[:, 1], c='r')
          plt.title("toy data with manual {} time".format(max_iter))
          plt.show()
  K = 3
  max_iters = 3
  runkMeans(b,K,max_iters)

#+end_src

#+RESULTS:


** EM algorithms

** link
机器学习代码和课件可在此下 [fn:xiaoxiong]



[fn:xiaoxiong]https://jia666-my.sharepoint.com/:f:/g/personal/hmp121_xkx_me/EsaG70R5NXdMgC7V1aYwyQcB5C-8nFiSYTWG3Uur9ZvbEA?e=1D2uPf
